Autodesk.Revit.DB.DisplacementElement.GetChildren
Returns a set of DisplacementElements which have this
DisplacementElement as a parent.
Returns:
The returned array is sorted by element id.
Since:
2014

Autodesk.Revit.DB.DisplacementElement.RemoveDisplacedElement(Autodesk.Revit.DB.Element)
Remove a displaced element from this DisplacementElement.
ElemToRemove:
The element to remove.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetAbsoluteDisplacement
The absolute displacement applied to the displaced elements.
Remarks:
The value is the relative translation of this DisplacementElement
plus the relative displacements of all of its ancestor DisplacementElements.
Returns:
The absolute displacement.
Since:
2014

Autodesk.Revit.DB.DisplacementElement.SetRelativeDisplacement(Autodesk.Revit.DB.XYZ)
Sets the relative displacement applied to the displaced elements by this DisplacementElement.
displacement:
The relative displacement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetRelativeDisplacement
The relative displacement applied to the displaced elements by this DisplacementElement.
Returns:
The relative displacement.
Since:
2014

Autodesk.Revit.DB.DisplacementElement.CanElementsBeAddedToDisplacementSet(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Indicates if these elements can be displaced by this DisplacementElement.
toDisplace:
The elements to displace.
Returns:
True if the elements can be displaced by this DisplacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.SetDisplacedElementIds(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the ids of the elements affected by this DisplacementElement.
displacedElemIds:
Set of ids of elements to be displaced by this DisplacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
For each individual element in the set displacedElemIds, isAllowedAsDisplacedElement must return true, and the
elements must not already be displaced in the specified view.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIdsFromAllChildren
The element ids of elements displaced by this DisplacementElement and any
DisplacementElement which declare this one as parent.
Returns:
The element ids.
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIds
The ids of the elements affected by this DisplacementElement.
Returns:
The element ids.
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetDisplacedElementIds(Autodesk.Revit.DB.View)
Returns the element ids of all displaced elements in the specified view.
view:
The view.
Returns:
The element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetDisplacementElementIds(Autodesk.Revit.DB.View)
The element ids of all DisplacementElements owned by the specified view.
view:
The view.
Returns:
The element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.IsNotEmpty(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Validates that the input set of element ids is valid for a DisplacementElement.
elementIds:
A set of element ids.
Returns:
True if the set of element ids is not empty.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetAdditionalElementsToDisplace(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Identify a set of elements that potentially should be displaced along with a given element.
Remarks:
For example, when a wall is displaced, any inserts or hosted elements should
also be displaced.
document:
the document
view:
the view
idToDisplace:
element id of element to displace
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.CanElementsBeDisplaced(Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Indicates if elements can be assigned to a new DisplacementElement.
Remarks:
A necessary condition is that isAllowedAsDisplacedElement
returns true for each individual element id.
In addition, if isElementDisplaced must return the same value
for all the specified element ids.
view:
The view.
elementIds:
The element ids.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.CanElementsBeDisplaced(Autodesk.Revit.DB.View,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.ElementId@)
Indicates if elements can be assigned to a new DisplacementElement.
Remarks:
A necessary condition is that isAllowedAsDisplacedElement
returns true for each individual element id.
In addition, if isElementDisplaced must return the same value
for all the specified element ids.
view:
The view.
elementIds:
The element ids.
commonDisplacedElementId:
If this method returns true, then this is the element id of
a DisplacementElement which lists all of elemIds among its
displaced elements.
Returns:
Returns true if the specified element ids can be assigned to a new DisplacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.IsValidAsParentInView(Autodesk.Revit.DB.View,Autodesk.Revit.DB.DisplacementElement)
Indicates whether the specified DisplacementElement can be used as a parent when
creating a DisplacementElement in the specified view.
view:
A view.
parent:
A DisplacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.IsAllowedAsDisplacedElement(Autodesk.Revit.DB.Element)
Indicates if the specified element is allowed to be displaced.
Remarks:
Exclusions include view specific elements as well as certain categories of elements.
element:
Any element.
Returns:
Returns true if the element is eligible to be assigned to a DisplacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.CanCategoryBeDisplaced(Autodesk.Revit.DB.ElementId)
Indicates whether elements of the specified category are eligible as displaced elements.
Remarks:
Elements may be disallowed as displaced elements for reasons other than their category.
categoryId:
Category id of element to be replaced.
Returns:
Returns true if elements of this category can be displaced, and false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.GetDisplacementElementId(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
The element id of the DisplacementElement that includes the specified element.
view:
The view.
id:
The element id.
Returns:
The element id of DisplacementElement that includes the specified element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.IsElementDisplacedInView(Autodesk.Revit.DB.View,Autodesk.Revit.DB.ElementId)
Indicates if the specified element displaced in the specified View.
view:
The view.
id:
The element id.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.ResetDisplacedElements
Sets the translation of the DisplacementElement to (0, 0, 0).
The DisplacementElement continues to exist, but its elements are displayed in their actual location.
Since:
2014

Autodesk.Revit.DB.DisplacementElement.Create(Autodesk.Revit.DB.Document,System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId},Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.View,Autodesk.Revit.DB.DisplacementElement)
Creates a new DisplacementElement as a child of the specified parent DisplacementElement.
document:
The Document
elementsToDisplace:
The elements to be displaced.
displacement:
The translation to be applied to the graphics of the displaced elements.
ownerDBView:
The 3D view which will own the DisplacementElement.
parentDisplacementElement:
An existing DisplacementElement that will be the parent of the one being created.
It must be owned by ownerDBView.
The relative transform of new DisplacementElement will be concatenated with the
absolute transform of the parent DisplacementElement.
If the elements specified by displacedElemIds are already displaced by another
DisplacementElement, then this must be that element.
Returns:
The id of the new DisplacementElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
#elementIds# contains no element ids.
-or-
ownerDBView is not a 3D view.
-or-
For each individual element in the set elementsToDisplace, isAllowedAsDisplacedElement must return true, and the
elements must either not already be displaced in the specified view, or else they
must all be displaced by the same displacement element in the view.
-or-
The DisplacementElement parentDisplacementElement in not owned by the view ownerDBView.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.DisplacementElement.ParentId
The element id of the parent DisplacementElement. This DisplacementElement's relative transform
will be concatenated with the absolute transform of its parent.
Since:
2014

Autodesk.Revit.DB.DisplacementElement
A view-specific element that causes other elements to appear to be displaced from their
actual locations.
Remarks:
The DisplacementElement does not actually change the location of any model
elements; it merely causes them to be displayed in a different location.
An element may only be displaced by a single DisplacementElement in any view. Assigning an
element to more than one DisplacementElement is an error condition.
A DisplacementElement can declare another DisplacementElement as its parent. In that case, its
transform will be concatenated with that of the parent, and the displacement of its associated
elements will be relative to the parent DisplacementElement.
Since:
2014